#Revisión general de los datos.

In [7]:
#Tratamiento y exportación de datos
#importamos librerias
import pandas as pd    # Librería para tablas y tratamiento de datos.
#Para una visualización completa de todas las columnas:
pd.set_option('display.max_columns', None)

In [8]:

df_clientes=pd.read_csv('clientes.csv')
df_clientes.sample(5)

    id_cliente  nombre   apellido             ciudad
204      C0205   Elena     García   Lisboa, Portugal
107      C0108  Carmen      Gómez  Marsella, Francia
104      C0105   Sofía  Rodríguez     Madrid, España
81       C0082   Marta      López  Toulouse, Francia
159      C0160     Ana     García    Braga, Portugal

In [11]:
df_clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_cliente  300 non-null    object
 1   nombre      300 non-null    object
 2   apellido    300 non-null    object
 3   ciudad      300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [9]:
df_productos=pd.read_csv('productos.csv')
df_productos.sample(5)

,id_producto,precio,categoria,descripcion
464,P0465,38.94 €,Electronics,IFQl2oaNI99vUxfCveVpq8skuWlXIjp4DgjWCx0Ue73SOO...
354,P0355,94.87 €,Electronics,yemNb91FWElaVGDR4Gp4rgOpOQekLbn0HOOoiat1ZnHOaM...
225,P0226,90.84 €,Books,wsrDWe2tU147iAFlGzscHcsBh12SGdKg7nVDz8gUYEbt0z...
51,P0052,91.26 €,Sports & Outdoors,pdYA30f99HhgFDbwsTw2uKQZQkDNXxxqt4b2DLlDYqx6IF...
493,P0494,8.46 €,Sports & Outdoors,XNYzTeiOeZB6dl8kMbROvkjqibxFa2o7cdApfHNtwkakxS...

In [12]:
df_productos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_producto  600 non-null    object
 1   precio       600 non-null    object
 2   categoria    600 non-null    object
 3   descripcion  600 non-null    object
dtypes: object(4)
memory usage: 18.9+ KB

In [10]:
df_ventas=pd.read_csv('ventas.csv')
df_ventas.sample(5)

      id_venta id_producto  cantidad       fecha id_cliente
77968  V007113       P0433         2  2022-11-06      C0163
13207  V007568       P0169         6  2023-01-01      C0067
20509  V004395       P0471         3  2021-09-24      C0025
63764  V005508       P0397         8  2021-05-11      C0143
33884  V001290       P0307         7  2020-01-20      C0212

In [13]:
df_ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80000 entries, 0 to 79999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_venta     80000 non-null  object
 1   id_producto  80000 non-null  object
 2   cantidad     80000 non-null  int64
 3   fecha        80000 non-null  object
 4   id_cliente   80000 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.1+ MB